notebook-org/effective-java.org
#+TITLE: <Effective Java> 读书笔记
#+LANGUAGE: en
#+OPTIONS: H:3 num:nil toc:t

-----

* 第2章 创建和销毁对象 (1 - 7)
** 第1条: 考虑用静态工厂方法代替构造器
   #+BEGIN_EXAMPLE
优点
1. 有名称(方法名), 可以确切地描述正被返回的对象
2. 不必在每次调用它们的时候都创建一个新对象, 例如 Boolean.valueOf(boolean)
3. 可以返回类型的任何子类型的对象
4. 在创建忽视类型实例的时候, 代码可以更简单, 例如 new ArrayList<Integer>() (1.8已改进)
缺点
1. 类如果不含公有或受保护的构造器, 就不能被子例化
2. 跟其他的静态方法实际上没有任何区别

静态方法的一些惯用名
- valueOf	类型转换
- of		valueOf的简洁写法, 在EnumSet中流行
- getInstance	返回实例
- newInstance	保证返回的是不同的实例
- getType	在不同类中使用, Type表示返回的对象类型
- newType	在不同类中使用, Type表示返回的对象类型
   #+END_EXAMPLE
** 第2条: 遇到多个构造器参数时要考虑用构造器
   #+BEGIN_EXAMPLE
设计模式中的: Builder模式
   #+END_EXAMPLE
** 第3条: 用私有构造器或者枚举类型强化 Singleton 属性
   #+BEGIN_EXAMPLE
单元素的枚举类型已经成为实现 Singleton 的最佳方法
   #+END_EXAMPLE
** 第4条: 通过私有构造器强化不可实例化的能力
   #+BEGIN_EXAMPLE
如果类不允许被实例化, 需要显式的声明, 例如 Math
public final class Math {
  /** Don't let anyone instantiate this class. */
  private Math() {}
  ...
}
   #+END_EXAMPLE
** 第5条: 避免创建不必要的对象
   #+BEGIN_EXAMPLE
当应该重用现有对象时, 就不要创建新的对象
   #+END_EXAMPLE
** 第6条: 消除过期的对象引用
   #+BEGIN_EXAMPLE
清空对象引用应该是一种例外, 而不是一种规范行为
只要类是自己管理内存, 就应该警惕内存泄漏问题
   #+END_EXAMPLE
** 第7条: 避免使用终结方法
   #+BEGIN_EXAMPLE
(如果不是看这本书, 我都不知道 Object.finalize() 方法)
不要依赖终结方法释放重要资源, 因为无法保证该方法一定会被调用

两种合理用法
1. 作为保护网, 比如 FileInputStream 中的 finalize() 检查用户有没有显示的调用close()
2. 终止非关键的本地资源
   #+END_EXAMPLE
* 第3章 对于所有对象都通用的方法 (8 - 12)
** 第8条: 覆盖 equals 时请遵守通用约定
   #+BEGIN_EXAMPLE
不覆盖 equals 的情况
- 类的每个实例在本质上都是唯一的, 例如: Thread, Object
- 不关心类是否提供了“逻辑相等”的测试功能
- 超类已经覆盖了 equals, 从超类继承过来的行为对于子类也是合适的
- 类是私有的或是包级私有的, 可以确定它的equals方法永远不会被调用

equals 的等价关系
自反性: x.equals(x) == true
对称性: if x.equals(y) == true, then y.equals(x) == true
传递性: if x.equals(y) == true, y.equals(z) == true, then x.equals(z) == true
一致性: 如果对象中比较的值没有修改, 那么多次调用的结果一样
非空性: x.equals(null) == false

实现高质量 equals 的诀窍
1. 使用 == 操作符检查“参数是否为找个对象的引用”, 如果是, 返回 true
2. 使用 instanceof 操作符检查“参数是否为正确的类型”, 如果不是, 返回 false
3. 把参数转换为正确的类型
4. 以此对比该类中的关键域, 检查参数中的域是否与该对象中对应的域相匹配
5. 问自己3个问题: 是否对称? 是否传递? 是否一致?
   #+END_EXAMPLE
** 第9条: 覆盖 equals 时总要覆盖 hashCode
   #+BEGIN_EXAMPLE
相等的对象必须具有相等的散列码(在覆盖了 equals 方法的类中, 也必须覆盖 hashcode 方法)
// 摘自 String.hashCode(), 注意要选取一个质数
int h = 0;
char val[] = value;
for (int i = 0; i < value.length; i++) {
    h = 31 * h + val[i];
}
hash = h;
   #+END_EXAMPLE
** 第10条: 始终要覆盖 toString
   #+BEGIN_EXAMPLE
建议所有的子类都覆盖这个方法; 这个方法应该返回对象中包含的所有值得关注的信息
如果指定了格式, 最好再提供一个相匹配的静态工厂或构造器
   #+END_EXAMPLE
** 第11条: 谨慎地覆盖 clone
   #+BEGIN_EXAMPLE
最好不要覆盖这个方法, 也不要调用它(除非要拷贝数组)
如果一定要实现对象拷贝: 请实现一个拷贝构造器或拷贝工厂(转换构造器或转换工厂)
   #+END_EXAMPLE
** 第12条: 考虑实现 Comparable 接口
   #+BEGIN_EXAMPLE
如果正在编写一个值类, 最好实现Comparable接口
实现条件:
1. x.compareTo(y) == -y.compareTo(x)
2. x.compareTo(y) > 0 && y.compareTo(z) > 0, 则: x.compareTo(z) > 0
3. x.compareTo(y) == 0, 则: x.compareTo(z) == y.compareTo(z)
4. (建议) (x.compareTo(y) == 0) == (x.equals(y))
   #+END_EXAMPLE
* 第4章 类和接口 (13 - 22)
** 第13条: 使类和成员的可访问性最小化
   #+BEGIN_EXAMPLE
尽可能地使每个类或者成员不被外界访问.
设计良好的模块, 把它的API与它的实现清晰的隔离开.
模块之间通过它们的API通信, 一个模块不需要知道其他模块内部工作情况.
   #+END_EXAMPLE
** 第14条: 在公有类中使用访问方法而非共有域
   #+BEGIN_EXAMPLE
如果类可以在它所在的包的外部进行访问, 就提供访问方法.
如果类是包级私有的, 或者是私有的嵌套类, 直接暴露它的数据域并没有本质的错误
   #+END_EXAMPLE
** 第15条: 使可变性最小化
   #+BEGIN_EXAMPLE
不可变类的优点:
1. 不可变对象本质上是线程安全的, 它们不要求同步.
2. 不仅可以共享不可变对象, 甚至也可以共享它们的内部信息.
3. 不可变对象为其他对象提供了大量的构建

不可变类的缺点: 对于每个不同的值都需要一个单独的对象

使类成为不可变, 要遵循的规则:
1. 不要提供任何会修改对象状态的方法.
2. 保证类不会被扩展.
3. 使所有的域都是 final 的.
4. 是所有的域都成为私有的.
5. 确保对于任何可变组件的互斥访问

如果要对一个不可变类进行复杂的多阶段操作, 最好的方法是提供一个可变配套类, 如 String 与 StringBuilder
   #+END_EXAMPLE
