notebook/effective-java.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-13 Thu 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lt;Effective Java&gt; 读书笔记</title>
<meta name="author" content="Saul Lawliet" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/assets/css/org.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">&lt;Effective Java&gt; 读书笔记</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org943f376">第2章 创建和销毁对象 (1 - 7)</a>
<ul>
<li><a href="#org797f217">第1条: 考虑用静态工厂方法代替构造器</a></li>
<li><a href="#org643029d">第2条: 遇到多个构造器参数时要考虑用构造器</a></li>
<li><a href="#org19c8a51">第3条: 用私有构造器或者枚举类型强化 Singleton 属性</a></li>
<li><a href="#org775f544">第4条: 通过私有构造器强化不可实例化的能力</a></li>
<li><a href="#org3c59754">第5条: 避免创建不必要的对象</a></li>
<li><a href="#org53a3646">第6条: 消除过期的对象引用</a></li>
<li><a href="#orgc4796ab">第7条: 避免使用终结方法</a></li>
</ul>
</li>
<li><a href="#orgd0266cc">第3章 对于所有对象都通用的方法 (8 - 12)</a>
<ul>
<li><a href="#orga0e21ae">第8条: 覆盖 equals 时请遵守通用约定</a></li>
<li><a href="#org36abc3c">第9条: 覆盖 equals 时总要覆盖 hashCode</a></li>
<li><a href="#orge322785">第10条: 始终要覆盖 toString</a></li>
<li><a href="#orgfb1f93e">第11条: 谨慎地覆盖 clone</a></li>
<li><a href="#orgdf8aa80">第12条: 考虑实现 Comparable 接口</a></li>
</ul>
</li>
<li><a href="#org4f684ea">第4章 类和接口 (13 - 22)</a>
<ul>
<li><a href="#org2972705">第13条: 使类和成员的可访问性最小化</a></li>
<li><a href="#orgebe15f8">第14条: 在公有类中使用访问方法而非共有域</a></li>
<li><a href="#org4771485">第15条: 使可变性最小化</a></li>
<li><a href="#orgc4ced24">第16条: 复合优先于继承</a></li>
<li><a href="#org03a2ff6">第17条: 要么为继承而设计, 并提供文档说明, 要么就禁止继承</a></li>
<li><a href="#orgf56a439">第18条: 接口优于抽象类</a></li>
<li><a href="#orgd28feae">第19条: 接口只用于定义类型</a></li>
<li><a href="#org6b256c4">第20条: 类层次优于标签类</a></li>
<li><a href="#orgce49f9a">第21条: 用函数对象表示策略</a></li>
<li><a href="#org1d83dc9">第22条: 优先考虑静态成员类</a></li>
</ul>
</li>
<li><a href="#org0e71ed3">第5章 泛型 (23 - 29)</a>
<ul>
<li><a href="#orga214387">第23条: 请不要在新代码中使用原生态类型</a></li>
<li><a href="#org8b1ab40">第24条: 消除非受检警告</a></li>
<li><a href="#orgc19178c">第25条: 列表优于数组</a></li>
<li><a href="#org3c5f3f1">第26条: 优先考虑泛型</a></li>
<li><a href="#org608e819">第27条: 优先考虑泛型方法</a></li>
<li><a href="#orgfb36059">第28条: 利用有限制通配符来提升API的灵活性</a></li>
<li><a href="#org07fe5e5">第29条: 优先考虑类型安全的异构容器</a></li>
</ul>
</li>
<li><a href="#org7015126">第6章 枚举和注解 (30 - 37)</a>
<ul>
<li><a href="#org0f087dc">第31条: 用实例域代替序数</a></li>
<li><a href="#org77d36f6">第32条: 用EnumSet代替位域</a></li>
<li><a href="#orgba62071">第33条: 用EnumMap代替序数索引</a></li>
<li><a href="#org6e5dae9">第34条: 用接口模拟可伸缩的枚举</a></li>
<li><a href="#org8a7c29d">第35条: 注解优于命名空间</a></li>
<li><a href="#orgc4dbea2">第36条: 坚持使用Override注解</a></li>
<li><a href="#org75ccb96">第37条: 用标记接口定义类型</a></li>
</ul>
</li>
<li><a href="#org4bef609">第7章 方法 (38 - 44)</a>
<ul>
<li><a href="#org32f61de">第38条: 检查参数的有效性</a></li>
<li><a href="#orgdd02c6f">第39条: 必要时进行保护性拷贝</a></li>
<li><a href="#orgb819113">第40条: 谨慎设计方法签名</a></li>
<li><a href="#orgf1aa743">第41条: 慎用重载</a></li>
<li><a href="#orgf6587c8">第42条: 慎用可变参数</a></li>
<li><a href="#org12118d8">第43条: 返回零长度的数组或者集合, 而不是null</a></li>
<li><a href="#orgab53bd9">第44条: 为所有导出的API元素编写文档注释</a></li>
</ul>
</li>
<li><a href="#orge438537">第8章 通用程序设计 (45 - 56)</a>
<ul>
<li><a href="#orgefd082f">第45条: 将局部变量的作用域最小化</a></li>
<li><a href="#org957038a">第46条: for-each循环优先传统的for循环</a></li>
<li><a href="#org9da3c25">第47条: 了解和使用类库</a></li>
<li><a href="#orgdf21dfc">第48条: 如果需要精确的答案, 请避免使用float和double</a></li>
<li><a href="#orgf573461">第49条: 基本类型优先于装箱基本类型</a></li>
<li><a href="#orgd2ed3e5">第50条: 如果其他类型更合适, 则尽量避免使用字符串</a></li>
<li><a href="#org8907c6b">第51条: 当心字符串连接的性能</a></li>
<li><a href="#orgdbfef7f">第52条: 通过接口引用对象</a></li>
<li><a href="#orgf06794b">第53条: 接口优先于反射机制</a></li>
<li><a href="#org1dab8ae">第54条: 谨慎的使用本地方法</a></li>
<li><a href="#org93fd6e8">第55条: 谨慎地进行优化</a></li>
<li><a href="#orgfff7e2c">第56条: 遵守普遍接受的命名惯例</a></li>
</ul>
</li>
<li><a href="#org3dd8ca7">第9章 异常 (57 - 65)</a>
<ul>
<li><a href="#org9f15b67">第57条: 只针对异常的情况才使用异常</a></li>
<li><a href="#org788c275">第58条: 对可恢复的情况使用受检异常, 对变成错误使用运行时异常</a></li>
<li><a href="#org1962eed">第59条: 避免不必要地使用受检的异常</a></li>
<li><a href="#orgad07cd4">第60条: 优先使用标准的异常</a></li>
<li><a href="#org1059c56">第61条: 抛出与抽象相对应的异常</a></li>
<li><a href="#orgda76a3f">第62条: 每个方法抛出的异常都要有文档</a></li>
<li><a href="#org1daa0ae">第63条: 在细节消息中包含能捕获失败的信息</a></li>
<li><a href="#org6ef0389">第64条: 努力使失败保持原子性</a></li>
<li><a href="#org5fc5287">第65条: 不要忽略异常</a></li>
</ul>
</li>
<li><a href="#org37101ca">第10章 并发 (66 - 73)</a>
<ul>
<li><a href="#orgdaba4e8">第66条: 同步访问共享的可变数据</a></li>
<li><a href="#orgcd5b0d7">第67条: 避免过度同步</a></li>
<li><a href="#org85ef958">第68条: executor 和 task 优于线程</a></li>
<li><a href="#org076564a">第69条: 并发工具优于 wait 和 notify</a></li>
<li><a href="#org8f1c3c2">第70条: 线程安全性的文档化</a></li>
<li><a href="#org51d53a1">第71条: 慎用延迟初始化</a></li>
<li><a href="#orga834e9b">第72条: 不要依赖于线程调度器</a></li>
</ul>
</li>
<li><a href="#org2a534fe">第11章 序列化 (74 - 78)</a>
<ul>
<li><a href="#org9810cc6">第74条: 谨慎地实现 Serializable 接口</a></li>
<li><a href="#org735e279">第75条: 考虑使用自定义的序列化形式</a></li>
<li><a href="#orgee22deb">第76条: 保护性地编写readObject方法</a></li>
<li><a href="#orgdce38ae">第77条: 对于实例控制, 枚举类型优先于readResolve</a></li>
<li><a href="#orgb81d75c">第78条: 考虑用序列化代理代替序列化实例</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org943f376" class="outline-2">
<h2 id="org943f376">第2章 创建和销毁对象 (1 - 7)</h2>
<div class="outline-text-2" id="text-org943f376">
</div>
<div id="outline-container-org797f217" class="outline-3">
<h3 id="org797f217">第1条: 考虑用静态工厂方法代替构造器</h3>
<div class="outline-text-3" id="text-org797f217">
<pre class="example" id="orged7f828">
优点
1. 有名称(方法名), 可以确切地描述正被返回的对象
2. 不必在每次调用它们的时候都创建一个新对象, 例如 Boolean.valueOf(boolean)
3. 可以返回类型的任何子类型的对象
4. 在创建忽视类型实例的时候, 代码可以更简单, 例如 new ArrayList&lt;Integer&gt;() (1.8已改进)
缺点
1. 类如果不含公有或受保护的构造器, 就不能被子例化
2. 跟其他的静态方法实际上没有任何区别

静态方法的一些惯用名
- valueOf	类型转换
- of		valueOf的简洁写法, 在EnumSet中流行
- getInstance	返回实例
- newInstance	保证返回的是不同的实例
- getType	在不同类中使用, Type表示返回的对象类型
- newType	在不同类中使用, Type表示返回的对象类型
</pre>
</div>
</div>
<div id="outline-container-org643029d" class="outline-3">
<h3 id="org643029d">第2条: 遇到多个构造器参数时要考虑用构造器</h3>
<div class="outline-text-3" id="text-org643029d">
<pre class="example" id="orgf66df4e">
设计模式中的: Builder模式
</pre>
</div>
</div>
<div id="outline-container-org19c8a51" class="outline-3">
<h3 id="org19c8a51">第3条: 用私有构造器或者枚举类型强化 Singleton 属性</h3>
<div class="outline-text-3" id="text-org19c8a51">
<pre class="example" id="org20292b6">
单元素的枚举类型已经成为实现 Singleton 的最佳方法
</pre>
</div>
</div>
<div id="outline-container-org775f544" class="outline-3">
<h3 id="org775f544">第4条: 通过私有构造器强化不可实例化的能力</h3>
<div class="outline-text-3" id="text-org775f544">
<pre class="example" id="orgb8291d2">
如果类不允许被实例化, 需要显式的声明, 例如 Math
public final class Math {
  /** Don't let anyone instantiate this class. */
  private Math() {}
  ...
}
</pre>
</div>
</div>
<div id="outline-container-org3c59754" class="outline-3">
<h3 id="org3c59754">第5条: 避免创建不必要的对象</h3>
<div class="outline-text-3" id="text-org3c59754">
<pre class="example" id="org16ffd8a">
当应该重用现有对象时, 就不要创建新的对象
</pre>
</div>
</div>
<div id="outline-container-org53a3646" class="outline-3">
<h3 id="org53a3646">第6条: 消除过期的对象引用</h3>
<div class="outline-text-3" id="text-org53a3646">
<pre class="example" id="orgb72e6b9">
清空对象引用应该是一种例外, 而不是一种规范行为
只要类是自己管理内存, 就应该警惕内存泄漏问题
</pre>
</div>
</div>
<div id="outline-container-orgc4796ab" class="outline-3">
<h3 id="orgc4796ab">第7条: 避免使用终结方法</h3>
<div class="outline-text-3" id="text-orgc4796ab">
<pre class="example" id="org000a77e">
(如果不是看这本书, 我都不知道 Object.finalize() 方法)
不要依赖终结方法释放重要资源, 因为无法保证该方法一定会被调用

两种合理用法
1. 作为保护网, 比如 FileInputStream 中的 finalize() 检查用户有没有显示的调用close()
2. 终止非关键的本地资源
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0266cc" class="outline-2">
<h2 id="orgd0266cc">第3章 对于所有对象都通用的方法 (8 - 12)</h2>
<div class="outline-text-2" id="text-orgd0266cc">
</div>
<div id="outline-container-orga0e21ae" class="outline-3">
<h3 id="orga0e21ae">第8条: 覆盖 equals 时请遵守通用约定</h3>
<div class="outline-text-3" id="text-orga0e21ae">
<pre class="example" id="orgfd5ff5d">
不覆盖 equals 的情况
- 类的每个实例在本质上都是唯一的, 例如: Thread, Object
- 不关心类是否提供了“逻辑相等”的测试功能
- 超类已经覆盖了 equals, 从超类继承过来的行为对于子类也是合适的
- 类是私有的或是包级私有的, 可以确定它的equals方法永远不会被调用

equals 的等价关系
自反性: x.equals(x) == true
对称性: if x.equals(y) == true, then y.equals(x) == true
传递性: if x.equals(y) == true, y.equals(z) == true, then x.equals(z) == true
一致性: 如果对象中比较的值没有修改, 那么多次调用的结果一样
非空性: x.equals(null) == false

实现高质量 equals 的诀窍
1. 使用 == 操作符检查“参数是否为找个对象的引用”, 如果是, 返回 true
2. 使用 instanceof 操作符检查“参数是否为正确的类型”, 如果不是, 返回 false
3. 把参数转换为正确的类型
4. 以此对比该类中的关键域, 检查参数中的域是否与该对象中对应的域相匹配
5. 问自己3个问题: 是否对称? 是否传递? 是否一致?
</pre>
</div>
</div>
<div id="outline-container-org36abc3c" class="outline-3">
<h3 id="org36abc3c">第9条: 覆盖 equals 时总要覆盖 hashCode</h3>
<div class="outline-text-3" id="text-org36abc3c">
<pre class="example" id="org611353e">
相等的对象必须具有相等的散列码(在覆盖了 equals 方法的类中, 也必须覆盖 hashcode 方法)
// 摘自 String.hashCode(), 注意要选取一个质数
int h = 0;
char val[] = value;
for (int i = 0; i &lt; value.length; i++) {
    h = 31 * h + val[i];
}
hash = h;
</pre>
</div>
</div>
<div id="outline-container-orge322785" class="outline-3">
<h3 id="orge322785">第10条: 始终要覆盖 toString</h3>
<div class="outline-text-3" id="text-orge322785">
<pre class="example" id="org5b54190">
建议所有的子类都覆盖这个方法; 这个方法应该返回对象中包含的所有值得关注的信息
如果指定了格式, 最好再提供一个相匹配的静态工厂或构造器
</pre>
</div>
</div>
<div id="outline-container-orgfb1f93e" class="outline-3">
<h3 id="orgfb1f93e">第11条: 谨慎地覆盖 clone</h3>
<div class="outline-text-3" id="text-orgfb1f93e">
<pre class="example" id="org2bf6b47">
最好不要覆盖这个方法, 也不要调用它(除非要拷贝数组)
如果一定要实现对象拷贝: 请实现一个拷贝构造器或拷贝工厂(转换构造器或转换工厂)
</pre>
</div>
</div>
<div id="outline-container-orgdf8aa80" class="outline-3">
<h3 id="orgdf8aa80">第12条: 考虑实现 Comparable 接口</h3>
<div class="outline-text-3" id="text-orgdf8aa80">
<pre class="example" id="org78fd891">
如果正在编写一个值类, 最好实现Comparable接口
实现条件:
1. x.compareTo(y) == -y.compareTo(x)
2. x.compareTo(y) &gt; 0 &amp;&amp; y.compareTo(z) &gt; 0, 则: x.compareTo(z) &gt; 0
3. x.compareTo(y) == 0, 则: x.compareTo(z) == y.compareTo(z)
4. (建议) (x.compareTo(y) == 0) == (x.equals(y))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f684ea" class="outline-2">
<h2 id="org4f684ea">第4章 类和接口 (13 - 22)</h2>
<div class="outline-text-2" id="text-org4f684ea">
</div>
<div id="outline-container-org2972705" class="outline-3">
<h3 id="org2972705">第13条: 使类和成员的可访问性最小化</h3>
<div class="outline-text-3" id="text-org2972705">
<pre class="example" id="org49fe903">
尽可能地使每个类或者成员不被外界访问.
设计良好的模块, 把它的API与它的实现清晰的隔离开.
模块之间通过它们的API通信, 一个模块不需要知道其他模块内部工作情况.
</pre>
</div>
</div>
<div id="outline-container-orgebe15f8" class="outline-3">
<h3 id="orgebe15f8">第14条: 在公有类中使用访问方法而非共有域</h3>
<div class="outline-text-3" id="text-orgebe15f8">
<pre class="example" id="org04abf18">
如果类可以在它所在的包的外部进行访问, 就提供访问方法.
如果类是包级私有的, 或者是私有的嵌套类, 直接暴露它的数据域并没有本质的错误
</pre>
</div>
</div>
<div id="outline-container-org4771485" class="outline-3">
<h3 id="org4771485">第15条: 使可变性最小化</h3>
<div class="outline-text-3" id="text-org4771485">
<pre class="example" id="orgcd43fd2">
不可变类的优点:
1. 不可变对象本质上是线程安全的, 它们不要求同步.
2. 不仅可以共享不可变对象, 甚至也可以共享它们的内部信息.
3. 不可变对象为其他对象提供了大量的构建

不可变类的缺点: 对于每个不同的值都需要一个单独的对象

使类成为不可变, 要遵循的规则:
1. 不要提供任何会修改对象状态的方法.
2. 保证类不会被扩展.
3. 使所有的域都是 final 的.
4. 是所有的域都成为私有的.
5. 确保对于任何可变组件的互斥访问

如果要对一个不可变类进行复杂的多阶段操作, 最好的方法是提供一个可变配套类, 如 String 与 StringBuilder
</pre>
</div>
</div>
