notebook-org/effective-java.org
** 第16条: 复合优先于继承
   #+BEGIN_EXAMPLE
只有当子类真正是超类的子类型时, 才适合用继承.
在包内使用继承是安全的, 通常情况, 一个包内的子类和超类的实现是在同一个程序员的控制下
跨包继承是危险的操作, 1:不清楚内部细节 2:后续如果超类升级, 子类也会受影响
为了解决跨包继承的问题, 可以使用一种叫做"复合"的设计, 实现一个转发类, 然后继承这个转发类.
复合: 不用扩展现在的类, 而是在新的类中增加一个私有域, 它引用现有类的一个实例.
转发方法: 新类中每个实例方法都可以调用被包含的现有类实例中对应的方法, 并返回它的结果.
   #+END_EXAMPLE
** 第17条: 要么为继承而设计, 并提供文档说明, 要么就禁止继承
   #+BEGIN_EXAMPLE
为继承而设计的类, 必须要有文档说明它可覆盖的方法的自用性.
为了继承而设计的类, 唯一的测试方法就是编写子类, 测试通过才可以发布类.
构造器不能调用可被覆盖的方法
   #+END_EXAMPLE
** 第18条: 接口优于抽象类
   #+BEGIN_EXAMPLE
- 现有的类可以很容易被更新, 以实现新的接口
- 接口是定义 mixin 的理想选择
- 接口允许我们构造非层次结构的类型框架

为重要的接口提供一个抽象的骨架实现类, 把接口和抽象类的优点结合起来.
接口的作用仍然是定义类型, 但骨架实现类接管了所有与接口实现相关的工作
   #+END_EXAMPLE
** 第19条: 接口只用于定义类型
   #+BEGIN_EXAMPLE
如果要导出常量, 应该用工具类代替常量接口
   #+END_EXAMPLE
** 第20条: 类层次优于标签类
   #+BEGIN_EXAMPLE
(没啥好说的, 基本操作)
   #+END_EXAMPLE
** 第21条: 用函数对象表示策略
   #+BEGIN_EXAMPLE
函数指针的主要用途就是实现策略模式
   #+END_EXAMPLE
** 第22条: 优先考虑静态成员类
   #+BEGIN_EXAMPLE
嵌套类: 静态成员类, 非静态成员类, 匿名类, 局部类
静态成员类: 外围类是类本身. 常见用法作为公有辅助类
非静态成员类: 外围类是类的实例, 常见用法定义一个 Adapter
   #+END_EXAMPLE
* 第5章 泛型 (23 - 29)
  #+BEGIN_EXAMPLE
术语:
List<String>                      参数化类型
String                            实际类型参数
List<E>                           泛型
E                                 形式类型参数
List<?>                           无限制通配符类型
List                              原生态类型
<E extends Number>                有限制类型参数
<T extends Comparable<T>>         递归类型限制
List<? extend Number>             有限制通配符类型
static <E> List<E> asList(E[] a)  泛型方法
String.class                      类型令牌
  #+END_EXAMPLE
** 第23条: 请不要在新代码中使用原生态类型
   #+BEGIN_EXAMPLE
使用原生态类型的缺点: 编译器不会对参数进行类型检查
   #+END_EXAMPLE
** 第24条: 消除非受检警告
   #+BEGIN_EXAMPLE
如果无法消除警告, 同时可以证明引起警告的代码是类型安全的.
可以用@SuppressWarnings("unchecked")注解来禁止这条警告, 使用时应该始终在尽可能小的范围中(永远不要使用在整个类上), 同时再添加一条注释, 说明为什么这么做是安全的.
  #+END_EXAMPLE
** 第25条: 列表优于数组
   #+BEGIN_EXAMPLE
如果代码有错误, 用数组时, 运行时发现; 用列表时, 编译器发现.
绝大多数时, 请用列表代替数组
  #+END_EXAMPLE
** 第26条: 优先考虑泛型
   #+BEGIN_EXAMPLE
public class Stack<E> { ... }
  #+END_EXAMPLE
** 第27条: 优先考虑泛型方法
   #+BEGIN_EXAMPLE
public static <E> Set<E> union(Set<E> s1, Set<E> s2) { ... }
  #+END_EXAMPLE
** 第28条: 利用有限制通配符来提升API的灵活性
   #+BEGIN_EXAMPLE
PECS = producer-extends, consumer-super
注: comparable, comparator 都是 consumer
Collection<? extend E> or Consumer<? super E>

Iterable<E> 可以理解为: E的Iterable接口
Iterable<? extend E> 可以理解为: E的某个子类型的Iterable接口

这两种写法后者更好. 因为在这个方法中, 你无须 形式类型参数 是什么
public static <E> void swap(List<E> list, int i, int j);
public static void swap(List<?> list, int i, int j);
  #+END_EXAMPLE
** 第29条: 优先考虑类型安全的异构容器
   #+BEGIN_EXAMPLE
异构容器的实现方式: Map<Class<?>, Object> map;
类的类型转换, 优先用下面的方法
public class Class<T> {
  public <U> Class<? extends U> asSubclass(Class<U> clazz);
  public T cast(Object obj);
  ...
}
  #+END_EXAMPLE
* 第6章 枚举和注解 (30 - 37)
** 第31条: 用实例域代替序数
   #+BEGIN_EXAMPLE
永远不要根据枚举的序数导出与它关联的值, 而是要将它保存在一个实例域中.
所有枚举都一个 ordinal() 方法, 它返回每个枚举常量在类型中的数字位置.
但大多数情况都用不到这个方法.
   #+END_EXAMPLE
** 第32条: 用EnumSet代替位域
   #+BEGIN_EXAMPLE
EnumSet的底层是long存储的, 所以性能上跟位域是差不多的, 而且封装了大部分的方法.
--- old ---
int STYLE_BOLD      = 1 << 0; // 1
int STYLE_ITALIC    = 1 << 1; // 2
int STYLE_UNDERLINE = 1 << 2; // 4
text.applyStyles(STYLE_BOLD | STYLE_ITALIC);

--- new ---
enum STYLE {BOLD, ITALIC, UNDERLINE};
text.applyStyles(EnumSet.of(Style.BOLD, Style.ITALIC);
   #+END_EXAMPLE
** 第33条: 用EnumMap代替序数索引
   #+BEGIN_EXAMPLE
如果要用到形如 "Set<E>[]" 或 "E[][]" 的结构, 请用EnumMap代替.
   #+END_EXAMPLE
** 第34条: 用接口模拟可伸缩的枚举
   #+BEGIN_EXAMPLE
少用这种模式, 除了这样的枚举类型: 它的元素表示在某种机器上的操作(比如操作码)
   #+END_EXAMPLE
** 第35条: 注解优于命名空间
   #+BEGIN_EXAMPLE
注解的功能要比命令空间强大的多, 所以一定要用注解代替命名空间
   #+END_EXAMPLE
** 第36条: 坚持使用Override注解
   #+BEGIN_EXAMPLE
在你想要覆盖超类声明的每个方法声明中使用Override注解
1. 如果确定要覆盖父类的方法时, 加上注解, 则编译器会帮你"检查错误"
2. 如果不小心写了一个方法, 恰好跟父类的方法一样, 则编译器会提醒你"无意识的覆盖"
   #+END_EXAMPLE
** 第37条: 用标记接口定义类型
   #+BEGIN_EXAMPLE
如果想要定义类型, 一定要使用接口
   #+END_EXAMPLE
* 第7章 方法 (38 - 44)
** 第38条: 检查参数的有效性
   #+BEGIN_EXAMPLE
每当编写方法或者构造器的时候, 应该考虑它的参数有哪些限制.
应该把这些限制写到文档中, 并在方法体的开头,通过显式的检查来实施这些限制.
导出的方法可以抛出异常, 内部的方法可以使用断言.
   #+END_EXAMPLE
** 第39条: 必要时进行保护性拷贝
   #+BEGIN_EXAMPLE
如果类具有从客户端得到或者返回到客户端的可变组件, 类就必须保护性地拷贝这些组件.
   #+END_EXAMPLE
** 第40条: 谨慎设计方法签名
   #+BEGIN_EXAMPLE
- 谨慎地选择方法的名称
- 不要过于追求提供便利的方法
- 避免过长的参数列表
  1. 把方法拆分成多个方法
  2. 创建辅助类来保存参数的分组, 通常用静态成员类
  3. 参数采用Builder模式
对于参数类型, 优先使用接口而不是类
对于 boolean 参数, 要优先使用两个元素的枚举类型
   #+END_EXAMPLE
** 第41条: 慎用重载
   #+BEGIN_EXAMPLE
对于重载方法的选择是静态的, 而对于被覆盖的方法的选择则是动态的
安全而保守的策略是, 永远不要导出两个具有相同参数数目的重载方法
反例: List<Integer> list; list.remove(1) 与 list.remove((Integer)1)
   #+END_EXAMPLE
** 第42条: 慎用可变参数
   #+BEGIN_EXAMPLE
必要时, 可以考虑 1个参数和多个, 而不是0个和多个
重视性能的情况下, 每个重载方法带有0至3个普通参数, 当参数的数目超过3个时, 就使用一个可变参数方法
   #+END_EXAMPLE
** 第43条: 返回零长度的数组或者集合, 而不是null
   #+BEGIN_EXAMPLE
返回类型为数组或者集合的方法没理由返回null, 而是返回一个零长度的数组或者集合.
   #+END_EXAMPLE
** 第44条: 为所有导出的API元素编写文档注释
   #+BEGIN_EXAMPLE
为了正确地编写API文档, 必须在每个被导出的类, 接口, 构造器, 方法和域声明之前增加一个文档注释
方法的文档注释应该简洁地描述出它和客户端之间的约定
同一个类或者接口中的两个成员或者构造器, 不应该具有同样的概要描述
为泛型或者方法编写文档时, 确保要在文档中说明所有的类型参数
为枚举类型编写文档时, 要确保在文档中说明常量
为注解类型编写文档时, 要确保在文档中说明所有成员
   #+END_EXAMPLE
* 第8章 通用程序设计 (45 - 56)
** 第45条: 将局部变量的作用域最小化
   #+BEGIN_EXAMPLE
要使局部变量的作用域最小化, 最有力的方法就是在第一次使用它的地方声明.
   #+END_EXAMPLE
** 第46条: for-each循环优先传统的for循环
   #+BEGIN_EXAMPLE
实现 Iterable 接口的对象都可以用for-each循环.
   #+END_EXAMPLE
