notebook/effective-java.html
<div id="outline-container-orgc4ced24" class="outline-3">
<h3 id="orgc4ced24">第16条: 复合优先于继承</h3>
<div class="outline-text-3" id="text-orgc4ced24">
<pre class="example" id="org38c8500">
只有当子类真正是超类的子类型时, 才适合用继承.
在包内使用继承是安全的, 通常情况, 一个包内的子类和超类的实现是在同一个程序员的控制下
跨包继承是危险的操作, 1:不清楚内部细节 2:后续如果超类升级, 子类也会受影响
为了解决跨包继承的问题, 可以使用一种叫做"复合"的设计, 实现一个转发类, 然后继承这个转发类.
复合: 不用扩展现在的类, 而是在新的类中增加一个私有域, 它引用现有类的一个实例.
转发方法: 新类中每个实例方法都可以调用被包含的现有类实例中对应的方法, 并返回它的结果.
</pre>
</div>
</div>
<div id="outline-container-org03a2ff6" class="outline-3">
<h3 id="org03a2ff6">第17条: 要么为继承而设计, 并提供文档说明, 要么就禁止继承</h3>
<div class="outline-text-3" id="text-org03a2ff6">
<pre class="example" id="orgf5ea5d3">
为继承而设计的类, 必须要有文档说明它可覆盖的方法的自用性.
为了继承而设计的类, 唯一的测试方法就是编写子类, 测试通过才可以发布类.
构造器不能调用可被覆盖的方法
</pre>
</div>
</div>
<div id="outline-container-orgf56a439" class="outline-3">
<h3 id="orgf56a439">第18条: 接口优于抽象类</h3>
<div class="outline-text-3" id="text-orgf56a439">
<pre class="example" id="org3960e97">
- 现有的类可以很容易被更新, 以实现新的接口
- 接口是定义 mixin 的理想选择
- 接口允许我们构造非层次结构的类型框架

为重要的接口提供一个抽象的骨架实现类, 把接口和抽象类的优点结合起来.
接口的作用仍然是定义类型, 但骨架实现类接管了所有与接口实现相关的工作
</pre>
</div>
</div>
<div id="outline-container-orgd28feae" class="outline-3">
<h3 id="orgd28feae">第19条: 接口只用于定义类型</h3>
<div class="outline-text-3" id="text-orgd28feae">
<pre class="example" id="orgd192e24">
如果要导出常量, 应该用工具类代替常量接口
</pre>
</div>
</div>
<div id="outline-container-org6b256c4" class="outline-3">
<h3 id="org6b256c4">第20条: 类层次优于标签类</h3>
<div class="outline-text-3" id="text-org6b256c4">
<pre class="example" id="org8df0f8c">
(没啥好说的, 基本操作)
</pre>
</div>
</div>
<div id="outline-container-orgce49f9a" class="outline-3">
<h3 id="orgce49f9a">第21条: 用函数对象表示策略</h3>
<div class="outline-text-3" id="text-orgce49f9a">
<pre class="example" id="orgef702fb">
函数指针的主要用途就是实现策略模式
</pre>
</div>
</div>
<div id="outline-container-org1d83dc9" class="outline-3">
<h3 id="org1d83dc9">第22条: 优先考虑静态成员类</h3>
<div class="outline-text-3" id="text-org1d83dc9">
<pre class="example" id="orgb7198b2">
嵌套类: 静态成员类, 非静态成员类, 匿名类, 局部类
静态成员类: 外围类是类本身. 常见用法作为公有辅助类
非静态成员类: 外围类是类的实例, 常见用法定义一个 Adapter
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e71ed3" class="outline-2">
<h2 id="org0e71ed3">第5章 泛型 (23 - 29)</h2>
<div class="outline-text-2" id="text-org0e71ed3">
<pre class="example" id="orga3ce680">
术语:
List&lt;String&gt;                      参数化类型
String                            实际类型参数
List&lt;E&gt;                           泛型
E                                 形式类型参数
List&lt;?&gt;                           无限制通配符类型
List                              原生态类型
&lt;E extends Number&gt;                有限制类型参数
&lt;T extends Comparable&lt;T&gt;&gt;         递归类型限制
List&lt;? extend Number&gt;             有限制通配符类型
static &lt;E&gt; List&lt;E&gt; asList(E[] a)  泛型方法
String.class                      类型令牌
</pre>
</div>
<div id="outline-container-orga214387" class="outline-3">
<h3 id="orga214387">第23条: 请不要在新代码中使用原生态类型</h3>
<div class="outline-text-3" id="text-orga214387">
<pre class="example" id="org1794f29">
使用原生态类型的缺点: 编译器不会对参数进行类型检查
</pre>
</div>
</div>
<div id="outline-container-org8b1ab40" class="outline-3">
<h3 id="org8b1ab40">第24条: 消除非受检警告</h3>
<div class="outline-text-3" id="text-org8b1ab40">
<pre class="example" id="orgde44b67">
如果无法消除警告, 同时可以证明引起警告的代码是类型安全的.
可以用@SuppressWarnings("unchecked")注解来禁止这条警告, 使用时应该始终在尽可能小的范围中(永远不要使用在整个类上), 同时再添加一条注释, 说明为什么这么做是安全的.
</pre>
</div>
</div>
<div id="outline-container-orgc19178c" class="outline-3">
<h3 id="orgc19178c">第25条: 列表优于数组</h3>
<div class="outline-text-3" id="text-orgc19178c">
<pre class="example" id="org3c33f2f">
如果代码有错误, 用数组时, 运行时发现; 用列表时, 编译器发现.
绝大多数时, 请用列表代替数组
</pre>
</div>
</div>
<div id="outline-container-org3c5f3f1" class="outline-3">
<h3 id="org3c5f3f1">第26条: 优先考虑泛型</h3>
<div class="outline-text-3" id="text-org3c5f3f1">
<pre class="example" id="org9cad7aa">
public class Stack&lt;E&gt; { ... }
</pre>
</div>
</div>
<div id="outline-container-org608e819" class="outline-3">
<h3 id="org608e819">第27条: 优先考虑泛型方法</h3>
<div class="outline-text-3" id="text-org608e819">
<pre class="example" id="orgadcfb9f">
public static &lt;E&gt; Set&lt;E&gt; union(Set&lt;E&gt; s1, Set&lt;E&gt; s2) { ... }
</pre>
</div>
</div>
<div id="outline-container-orgfb36059" class="outline-3">
<h3 id="orgfb36059">第28条: 利用有限制通配符来提升API的灵活性</h3>
<div class="outline-text-3" id="text-orgfb36059">
<pre class="example" id="orgaa7caa5">
PECS = producer-extends, consumer-super
注: comparable, comparator 都是 consumer
Collection&lt;? extend E&gt; or Consumer&lt;? super E&gt;

Iterable&lt;E&gt; 可以理解为: E的Iterable接口
Iterable&lt;? extend E&gt; 可以理解为: E的某个子类型的Iterable接口

这两种写法后者更好. 因为在这个方法中, 你无须 形式类型参数 是什么
public static &lt;E&gt; void swap(List&lt;E&gt; list, int i, int j);
public static void swap(List&lt;?&gt; list, int i, int j);
</pre>
</div>
</div>
<div id="outline-container-org07fe5e5" class="outline-3">
<h3 id="org07fe5e5">第29条: 优先考虑类型安全的异构容器</h3>
<div class="outline-text-3" id="text-org07fe5e5">
<pre class="example" id="org30124d9">
异构容器的实现方式: Map&lt;Class&lt;?&gt;, Object&gt; map;
类的类型转换, 优先用下面的方法
public class Class&lt;T&gt; {
  public &lt;U&gt; Class&lt;? extends U&gt; asSubclass(Class&lt;U&gt; clazz);
  public T cast(Object obj);
  ...
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7015126" class="outline-2">
<h2 id="org7015126">第6章 枚举和注解 (30 - 37)</h2>
<div class="outline-text-2" id="text-org7015126">
</div>
<div id="outline-container-org0f087dc" class="outline-3">
<h3 id="org0f087dc">第31条: 用实例域代替序数</h3>
<div class="outline-text-3" id="text-org0f087dc">
<pre class="example" id="org6d8ad49">
永远不要根据枚举的序数导出与它关联的值, 而是要将它保存在一个实例域中.
所有枚举都一个 ordinal() 方法, 它返回每个枚举常量在类型中的数字位置.
但大多数情况都用不到这个方法.
</pre>
</div>
</div>
<div id="outline-container-org77d36f6" class="outline-3">
<h3 id="org77d36f6">第32条: 用EnumSet代替位域</h3>
<div class="outline-text-3" id="text-org77d36f6">
<pre class="example" id="org6bb8888">
EnumSet的底层是long存储的, 所以性能上跟位域是差不多的, 而且封装了大部分的方法.
--- old ---
int STYLE_BOLD      = 1 &lt;&lt; 0; // 1
int STYLE_ITALIC    = 1 &lt;&lt; 1; // 2
int STYLE_UNDERLINE = 1 &lt;&lt; 2; // 4
text.applyStyles(STYLE_BOLD | STYLE_ITALIC);

--- new ---
enum STYLE {BOLD, ITALIC, UNDERLINE};
text.applyStyles(EnumSet.of(Style.BOLD, Style.ITALIC);
</pre>
</div>
</div>
<div id="outline-container-orgba62071" class="outline-3">
<h3 id="orgba62071">第33条: 用EnumMap代替序数索引</h3>
<div class="outline-text-3" id="text-orgba62071">
<pre class="example" id="org6397bcf">
如果要用到形如 "Set&lt;E&gt;[]" 或 "E[][]" 的结构, 请用EnumMap代替.
</pre>
</div>
</div>
<div id="outline-container-org6e5dae9" class="outline-3">
<h3 id="org6e5dae9">第34条: 用接口模拟可伸缩的枚举</h3>
<div class="outline-text-3" id="text-org6e5dae9">
<pre class="example" id="orgadf937c">
少用这种模式, 除了这样的枚举类型: 它的元素表示在某种机器上的操作(比如操作码)
</pre>
</div>
</div>
<div id="outline-container-org8a7c29d" class="outline-3">
<h3 id="org8a7c29d">第35条: 注解优于命名空间</h3>
<div class="outline-text-3" id="text-org8a7c29d">
<pre class="example" id="orgce65999">
注解的功能要比命令空间强大的多, 所以一定要用注解代替命名空间
</pre>
</div>
</div>
<div id="outline-container-orgc4dbea2" class="outline-3">
<h3 id="orgc4dbea2">第36条: 坚持使用Override注解</h3>
<div class="outline-text-3" id="text-orgc4dbea2">
<pre class="example" id="org3d76070">
在你想要覆盖超类声明的每个方法声明中使用Override注解
1. 如果确定要覆盖父类的方法时, 加上注解, 则编译器会帮你"检查错误"
2. 如果不小心写了一个方法, 恰好跟父类的方法一样, 则编译器会提醒你"无意识的覆盖"
</pre>
</div>
</div>
<div id="outline-container-org75ccb96" class="outline-3">
<h3 id="org75ccb96">第37条: 用标记接口定义类型</h3>
<div class="outline-text-3" id="text-org75ccb96">
<pre class="example" id="org7590815">
如果想要定义类型, 一定要使用接口
</pre>
</div>
</div>
</div>
<div id="outline-container-org4bef609" class="outline-2">
<h2 id="org4bef609">第7章 方法 (38 - 44)</h2>
<div class="outline-text-2" id="text-org4bef609">
</div>
<div id="outline-container-org32f61de" class="outline-3">
<h3 id="org32f61de">第38条: 检查参数的有效性</h3>
<div class="outline-text-3" id="text-org32f61de">
<pre class="example" id="org6b079d0">
每当编写方法或者构造器的时候, 应该考虑它的参数有哪些限制.
应该把这些限制写到文档中, 并在方法体的开头,通过显式的检查来实施这些限制.
导出的方法可以抛出异常, 内部的方法可以使用断言.
</pre>
</div>
</div>
<div id="outline-container-orgdd02c6f" class="outline-3">
<h3 id="orgdd02c6f">第39条: 必要时进行保护性拷贝</h3>
<div class="outline-text-3" id="text-orgdd02c6f">
<pre class="example" id="org6e8c5f4">
如果类具有从客户端得到或者返回到客户端的可变组件, 类就必须保护性地拷贝这些组件.
</pre>
</div>
</div>
<div id="outline-container-orgb819113" class="outline-3">
<h3 id="orgb819113">第40条: 谨慎设计方法签名</h3>
<div class="outline-text-3" id="text-orgb819113">
<pre class="example" id="org031bc35">
- 谨慎地选择方法的名称
- 不要过于追求提供便利的方法
- 避免过长的参数列表
  1. 把方法拆分成多个方法
  2. 创建辅助类来保存参数的分组, 通常用静态成员类
  3. 参数采用Builder模式
对于参数类型, 优先使用接口而不是类
对于 boolean 参数, 要优先使用两个元素的枚举类型
</pre>
</div>
</div>
<div id="outline-container-orgf1aa743" class="outline-3">
<h3 id="orgf1aa743">第41条: 慎用重载</h3>
<div class="outline-text-3" id="text-orgf1aa743">
<pre class="example" id="orgc8e8bc0">
对于重载方法的选择是静态的, 而对于被覆盖的方法的选择则是动态的
安全而保守的策略是, 永远不要导出两个具有相同参数数目的重载方法
反例: List&lt;Integer&gt; list; list.remove(1) 与 list.remove((Integer)1)
</pre>
</div>
</div>
<div id="outline-container-orgf6587c8" class="outline-3">
<h3 id="orgf6587c8">第42条: 慎用可变参数</h3>
<div class="outline-text-3" id="text-orgf6587c8">
<pre class="example" id="orgfc7b98b">
必要时, 可以考虑 1个参数和多个, 而不是0个和多个
重视性能的情况下, 每个重载方法带有0至3个普通参数, 当参数的数目超过3个时, 就使用一个可变参数方法
</pre>
</div>
</div>
<div id="outline-container-org12118d8" class="outline-3">
<h3 id="org12118d8">第43条: 返回零长度的数组或者集合, 而不是null</h3>
<div class="outline-text-3" id="text-org12118d8">
<pre class="example" id="org63b2d75">
返回类型为数组或者集合的方法没理由返回null, 而是返回一个零长度的数组或者集合.
</pre>
</div>
</div>
<div id="outline-container-orgab53bd9" class="outline-3">
<h3 id="orgab53bd9">第44条: 为所有导出的API元素编写文档注释</h3>
<div class="outline-text-3" id="text-orgab53bd9">
<pre class="example" id="org871b0c9">
为了正确地编写API文档, 必须在每个被导出的类, 接口, 构造器, 方法和域声明之前增加一个文档注释
方法的文档注释应该简洁地描述出它和客户端之间的约定
同一个类或者接口中的两个成员或者构造器, 不应该具有同样的概要描述
为泛型或者方法编写文档时, 确保要在文档中说明所有的类型参数
为枚举类型编写文档时, 要确保在文档中说明常量
为注解类型编写文档时, 要确保在文档中说明所有成员
</pre>
</div>
</div>
</div>
<div id="outline-container-orge438537" class="outline-2">
<h2 id="orge438537">第8章 通用程序设计 (45 - 56)</h2>
<div class="outline-text-2" id="text-orge438537">
</div>
<div id="outline-container-orgefd082f" class="outline-3">
<h3 id="orgefd082f">第45条: 将局部变量的作用域最小化</h3>
<div class="outline-text-3" id="text-orgefd082f">
<pre class="example" id="org37b6a29">
要使局部变量的作用域最小化, 最有力的方法就是在第一次使用它的地方声明.
</pre>
</div>
</div>
<div id="outline-container-org957038a" class="outline-3">
<h3 id="org957038a">第46条: for-each循环优先传统的for循环</h3>
<div class="outline-text-3" id="text-org957038a">
<pre class="example" id="orgd4cf7cd">
实现 Iterable 接口的对象都可以用for-each循环.
</pre>
</div>
</div>
