notebook-org/effective-java.org
** 第47条: 了解和使用类库
   #+BEGIN_EXAMPLE
不要重复造轮子, 如果一个比较常用的功能, 优先去标准库里找.
好处:
1. 完整的测试, 发行, 超多人的使用, 工业标准, 性能最优.
2. 查看源码可以学习主流的编码风格
   #+END_EXAMPLE
** 第48条: 如果需要精确的答案, 请避免使用float和double
   #+BEGIN_EXAMPLE
1. 使用 BigDecimal, 比较繁琐, 好处是可以完全控制舍入.
2. 使用 int 或 long, 优先使用这条.
   #+END_EXAMPLE
** 第49条: 基本类型优先于装箱基本类型
   #+BEGIN_EXAMPLE
当在一项操作中混合使用基本类型和装箱类型时, 装箱类型会自动拆箱(有风险, 比如空指针).
应当只有在集合中才使用装箱类型.
   #+END_EXAMPLE
** 第50条: 如果其他类型更合适, 则尽量避免使用字符串
   #+BEGIN_EXAMPLE
不要用字符串代替其他类型(如int, boolean, enum).
   #+END_EXAMPLE
** 第51条: 当心字符串连接的性能
   #+BEGIN_EXAMPLE
因为字符串是不可变的, 所以当两个字符串连接时(+), 它们的内容都要被拷贝(性能问题).
当需要大量连接的时候, 用 StringBuilder(非同步) / StringBuffer(同步) 代替 String
   #+END_EXAMPLE
** 第52条: 通过接口引用对象
   #+BEGIN_EXAMPLE
Vector<Subscriber> subscribers = new Vector<Subscriber>();    // Bad
  List<Subscriber> subscribers = new Vector<Subscriber>();    // Good, 更灵活
                           ... = new ArrayList<Subscriber>(); // 易于更换实现
   #+END_EXAMPLE
** 第53条: 接口优先于反射机制
   #+BEGIN_EXAMPLE
反射缺点:
1. 丧失了编译时类型检查的好处
2. 执行反射访问所需要的代码非常笨拙和冗长
3. 性能损失
反射好处:
访问编译时无法获取的类
   #+END_EXAMPLE
** 第54条: 谨慎的使用本地方法
   #+BEGIN_EXAMPLE
使用本地方法来提高性能的做法不值得提倡
   #+END_EXAMPLE
** 第55条: 谨慎地进行优化
   #+BEGIN_EXAMPLE
在设计之初就要考虑性能问题
要努力编写好的程序而不是快的程序
   #+END_EXAMPLE
** 第56条: 遵守普遍接受的命名惯例
   #+BEGIN_EXAMPLE
几个例子
Package			com.google.inject, org.joda.time.format
Class or Interface	Timer, FutureTask, LinkedHashMap, HttpServlet
Method or Field		remove, ensureCapacity, getCrc
Constant Field		MIN_VALUE, NEGATIVE_INFINITY
Local Variable		i, xref, houseNumber
Type Parameter		T, E, K, V, X, T1, T2
   #+END_EXAMPLE
* 第9章 异常 (57 - 65)
** 第57条: 只针对异常的情况才使用异常
   #+BEGIN_EXAMPLE
异常应该只用于异常的情况下, 它们永远不应该用于正常的控制流
   #+END_EXAMPLE
** 第58条: 对可恢复的情况使用受检异常, 对变成错误使用运行时异常
   #+BEGIN_EXAMPLE
对可恢复的情况, 使用受检异常; 对于程序错误, 使用运行时异常(RuntimeException 的子类)
   #+END_EXAMPLE
** 第59条: 避免不必要地使用受检的异常
   #+BEGIN_EXAMPLE
受检的异常, 会给调用者带来额外的负担(需要编写try-catch块)
   #+END_EXAMPLE
** 第60条: 优先使用标准的异常
   #+BEGIN_EXAMPLE
优先熟悉并使用标准库, 没什么好说的.

常用的异常:
IllegalArgumentException         非null的参数值不正确
IllegalStateException            对于方法调用而言, 对象状态不合适
NullPointerException             在禁止使用null的情况下参数值为null
IndexOUtOfBoundsException        下标参数值越界
ConcurrentModificationException  在禁止并发修改的情况下, 检测到对象的并发修改
UnsupportedOperationException    对象不支持用户请求的方法
   #+END_EXAMPLE
** 第61条: 抛出与抽象相对应的异常
   #+BEGIN_EXAMPLE
异常转译: 更高层的实现应该捕获低层的异常, 同时抛出可以按照高层抽象进行解释的异常
异常链: 在异常转译的基础上, 低层异常作为参数构造出高层异常
   #+END_EXAMPLE
** 第62条: 每个方法抛出的异常都要有文档
   #+BEGIN_EXAMPLE
永远不要声明一个方法 "throws Exception" 或 "throws Throwable"
只有受检的异常才包含在方法的声明中
   #+END_EXAMPLE
** 第63条: 在细节消息中包含能捕获失败的信息
   #+BEGIN_EXAMPLE
为了捕获失败, 异常的细节信息应该包含所有 "对该异常有贡献" 的参数和域的值
例如: java.lang.IndexOutOfBoundsException的异常细节只有越界的index
更好的异常细节应该包含: 上界, 下界, index
   #+END_EXAMPLE
** 第64条: 努力使失败保持原子性
   #+BEGIN_EXAMPLE
定义: 失败的方法调用应该使对象保持在被调用之前的状态
(以下方法难度递增)
1. 设计不可变对象
2. 先对参数进行检查
3. 调整计算处理过程的顺序, 可能失败的计算在修改对象的之前执行
4. 编写一段恢复代码
5. 在对象的一份临时拷贝上执行, 操作成功之后用临时拷贝的结果代替对象的内容
   #+END_EXAMPLE
** 第65条: 不要忽略异常
   #+BEGIN_EXAMPLE
要相信API的设计者声明一个方法将抛出某个异常的时候, 他们一定正在试图说明某些事情, 不要忽略它!
捕获一个异常的时候, 一定不要用空的catch块, 至少加个注释说明为什么这样做.
   #+END_EXAMPLE
* 第10章 并发 (66 - 73)
** 第66条: 同步访问共享的可变数据
   #+BEGIN_EXAMPLE
当多个线程共享可变数据的时候, 每个读或写数据的线程都必须执行同步.
基本的方式有: synchronized, volatile, AtomicXXX
   #+END_EXAMPLE
** 第67条: 避免过度同步
   #+BEGIN_EXAMPLE
在同步区内尽量少调用外部方法
在同步区内做尽可能少的工作(获得锁, 检查共享数据, 根据需要转换数据, 释放锁)
如果在内部同步了类, 可以使用分拆锁/分离锁/非阻塞来控制并发度
   #+END_EXAMPLE
** 第68条: executor 和 task 优于线程
   #+BEGIN_EXAMPLE
以前 Thread 是即充当工作单元, 又是执行机制, 现在工作单元和执行机制是分开的.
工作单元: 也称为 task, 有两种 Runnable(无返回值) 和 Callable(有返回值)
执行机制: executor service
由于有不同的 executor, 所以这种方式极大的提高了灵活性

通常用 Executors 来创建 Executor
建议用 ScheduledThreadPoolExecutor 代替 Timer
   #+END_EXAMPLE
** 第69条: 并发工具优于 wait 和 notify
   #+BEGIN_EXAMPLE
由于JDK1.5新增了并发工具, 所以没有理由在新代码中使用 wait 和 notify
如果维护在使用 wait 和 notify 的代码, 一定要用标准模式的 while 循环调用 wait
一般情况, 应该优先使用 notifyAll, 而不是使用notify

并发工具分成三类: Executor Framework, 并发集合, 同步器
   #+END_EXAMPLE
** 第70条: 线程安全性的文档化
   #+BEGIN_EXAMPLE
当一个类的实例或者静态方法被并发使用的时候, 一定要看文档如果描述其行为的并发程度
每个类都应该清楚地在文档中说明它的线程安全属性
几种线程安全级别:
- 不可变的. 如: String, Long
- 无条件的线程安全. 如: Random, ConcurrentHashMap
- 有条件的线程安全. 如: Collections.synchronized包装返回的集合, 他们的迭代器要求外部同步
- 非线程安全. 如: ArrayList, HashMap
- 线程对立的. 非常少见, 可以忽略
   #+END_EXAMPLE
** 第71条: 慎用延迟初始化
   #+BEGIN_EXAMPLE
正常的初始化要优先于延迟初始化. 除非绝对必要, 否则不要用延迟初始化
延时化技术
静态域: 使用 lazy initialization holder class 模式
private static class FieldHolder {
  static final FieldType type = computeFielValue();
}
static FieldType getField() { return FieldHolder.field; }
实例域: 使用双重检查模式, 如果可以接受重复初始化, 可以使用单重检查模式
注意实例域一定要声明成 volalite
   #+END_EXAMPLE
** 第72条: 不要依赖于线程调度器
   #+BEGIN_EXAMPLE
任何依赖于线程调度器来达到正确性或者性能要求的程序, 很有可能都是不可以移植的
作为推论, 不要依赖 Thread.yield 或者线程优先级, 它们仅仅是对调度器做些暗示
   #+END_EXAMPLE
* 第11章 序列化 (74 - 78)
** 第74条: 谨慎地实现 Serializable 接口
   #+BEGIN_EXAMPLE
代价1: 一旦一个被发布, 就大大降低了"改变这个类的实现"的灵活性
代价2: 它增加了出现 Bug 和安全漏洞的可能性
代价3: 随着类发行新的版本, 相关的测试负担也增加了

实现 Serializable 接口并不是一个很轻松就可以做出的决定
为了继承而设计的类应该尽可能少地去实现 Serializable 接口, 用户的接口也应该尽可能少地继承 Serializable 接口
为了继承而设计的不可序列化的类, 应该考虑提供一个无参数构造器
   #+END_EXAMPLE
** 第75条: 考虑使用自定义的序列化形式
   #+BEGIN_EXAMPLE
如果一个对象的物理表示法等同于它的逻辑内容, 可能就适用于使用默认的序列化形式
private void writeObject(ObjectOutputStream s) throws IOException;
private void readObject(ObjectInputStream s) throws IOException, ClassNotFoundException;
   #+END_EXAMPLE
** 第76条: 保护性地编写readObject方法
   #+BEGIN_EXAMPLE
对于对象引用域必须保持为私有的类, 要保护性地拷贝这些域中的每个对象. 不可变类的组件就属于这一类别
对于任何约束条件, 如果检查失败, 则抛出一个InvalidObjectException异常. 这些检查动作应该跟在所有的保护性拷贝之后
如果整个对象图在被反序列化之后必须进行验证, 就应该使用ObjectInputValidation接口
无论是直接方式还是间接方式, 都不要调用类中任何可被覆盖的方法
   #+END_EXAMPLE
